In [1]:
import sqlite3
conn = sqlite3.connect("library_db.db")
cur = conn.cursor()
cur.execute('''
    CREATE TABLE IF NOT EXISTS books (
        book_id INTEGER PRIMARY KEY,
        title TEXT,
        author TEXT,
        price REAL
    )
''')
conn.commit()
conn.close()
print("Database and table created.")

Database and table created.

In [7]:
conn = sqlite3.connect("library_db.db")
cur = conn.cursor()
books_data = [
    (1, "Five Point Someone", "Chetan Bhagat", 146.0),
    (2, "The God Of Small Things", "Arundhati Roy", 363.0),
    (3, "The White Tiger", "Aravind Adiga", 400.0)
]
cur.executemany("INSERT OR IGNORE INTO books VALUES (?, ?, ?, ?)", books_data)
conn.commit()
conn.close()
print("3 books inserted.")

3 books inserted.

In [8]:
conn = sqlite3.connect("library_db.db")
cur = conn.cursor()
cur.execute("SELECT SUM(price) FROM books")
total_price = cur.fetchone()[0]
print("Total Price of All Books:", total_price)
conn.close()

Total Price of All Books: 1148.0

In [9]:
import pandas as pd
conn = sqlite3.connect("library_db.db")
df = pd.read_sql_query("SELECT * FROM books", conn)
conn.close()
df.to_csv("books_data.csv", index=False)
print("Data saved to books_data.csv")
df

Data saved to books_data.csv

   book_id          title         author  price
0        1  The Alchemist   Paulo Coelho  299.0
1        2  Atomic Habits    James Clear  499.0
2        3         Ikigai  Héctor García  350.0